Autodesk.Revit.DB.Structure.AlignedFreeFormSetOrientationOptions
Orientation options for Aligned Free Form Rebar set.
Since:
2024
Since:
2024

Autodesk.Revit.DB.Structure.AlignedFreeFormSetOrientationOptions.PerpendicularToFace
Cutting planes are oriented perpendicular to a selected planar face, X or Y vector being the face normal.

Autodesk.Revit.DB.Structure.AlignedFreeFormSetOrientationOptions.ParallelToFace
Cutting planes are parallel to a selected planar face.

Autodesk.Revit.DB.Structure.AlignedFreeFormSetOrientationOptions.Vertical
Cutting planes are oriented vertically, X or Y vector being Z axis.

Autodesk.Revit.DB.Structure.AlignedFreeFormSetOrientationOptions.AlignedToDistributionPath
Cutting planes are perpendicular to the distribution path.